---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.EquivalentDiameter
source: html/d9a6f2ee-6a9e-f8a0-da64-64739805d33d.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.EquivalentDiameter Property

The equivalent diameter of the duct. Units: (ft).

## Syntax (C#)
```csharp
[ObsoleteAttribute("This property is deprecated in Revit 2024 and may be removed in a later version of Revit. You may instead use the 'HydraulicDiameter' property in the calculation.")]
public double EquivalentDiameter { get; set; }
```